Откуда данные: https://www.kaggle.com/c/titanic

In [ ]:
!ls -lh

---

In [2]:
import pandas as pd

In [3]:
train = pd.read_csv('00_titanic_train.csv')

In [ ]:
train

## Описание данных

| Variable | Definition | Key |
|----------|------------|-----|
|survival | Survival | 0 = No <br> 1 = Yes|
|pclass | Ticket class | 1 = 1st = Upper <br> 2 = 2nd = Middle <br> 3 = 3rd = Lower |
|sex | Sex | |
|Age | Age in years |  |
|sibsp | # of siblings <br> spouses aboard the Titanic | |
|parch | # of parents <br> children aboard the Titanic | |
|ticket | Ticket number | |
|fare | Passenger fare | |
|cabin | Cabin number | |
|embarked | Port of Embarkation | C = Cherbourg <br> Q = Queenstown <br> S = Southampton|

<b>age</b><br>
    Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

<b>sibsp</b><br>
    The dataset defines family relations in this way...<br>
    Sibling = brother, sister, stepbrother, stepsister<br>
    Spouse = husband, wife (mistresses and fiancés were ignored)

<b>parch</b><br>
    The dataset defines family relations in this way...<br>
    Parent = mother, father<br>
    Child = daughter, son, stepdaughter, stepson<br>
    Some children travelled only with a nanny, therefore parch=0 for them.

---

## pandas: head, tail

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.head.html

<i>DataFrame.head(n=5)</i><br>
&nbsp;&nbsp;&nbsp;&nbsp;Return the first n rows.

In [ ]:
train.head()

In [ ]:
train.head(2)

In [ ]:
train.tail(2)

---

## pandas: shape

In [ ]:
train.shape

---

## pandas: columns, index

In [ ]:
train.columns

In [ ]:
train.index

## pandas: T

In [ ]:
train.head(4).T

In [ ]:
transpose_train = train.T

In [ ]:
transpose_train

In [ ]:
## pandas: columns, index, что теперь columns, а что index в transpose_train. Проверим на практике.

## ваш код :-)

---

## pandas: info

In [ ]:
train.info()

---

## pandas: describe

In [ ]:
train.describe()

In [ ]:
train.describe(percentiles=[0.99])

---

## pandas: Series

In [ ]:
train['Name']

In [ ]:
list(train['Name'])

In [ ]:
## как пройти циклом for по всем именам? и вывести например всех 'John'

# ваш код :-)

---

## pandas: map

In [ ]:
'skillfactory'

In [ ]:
len('skillfactory')

In [ ]:
train['Name'].map(len)

In [ ]:
def is_Mr(s):
    return 'Mr.' in s

In [ ]:
train['Name'].map(is_Mr)

In [ ]:
train['Name'].map(lambda s: 'Mr' in s)

In [ ]:
train['is_Mr'] = train['Name'].map(lambda s: 'Mr.' in s)

In [ ]:
train.head()

In [ ]:
train['Name'].is_unique

In [ ]:
train['PassengerId'].is_unique

In [ ]:
train['Age'].is_unique

---

## pandas: select columns

In [ ]:
train.head()

In [ ]:
train[['PassengerId', 'Embarked', 'Pclass']].head()

---

## pandas: select rows

In [ ]:
train[train['Sex'] == 'male'].head()

In [ ]:
train[train['PassengerId'] == 666]

In [ ]:
train[train['Age'].isnull()].head()

In [ ]:
train[~train['Age'].isnull()].head()

In [ ]:
train[train['Embarked'].isin(['Q', 'C'])].head()

In [ ]:
## выбрать только те строки, где имя содержит Name

# ваш код :-)

In [ ]:
train[
    train['Embarked'].isin(['Q', 'C']) & (train['Age'] > 40)
].head()

In [ ]:
train[
    train['Embarked'].isin(['Q', 'C']) | (train['Age'] > 40)
].head()

---

## pandas: loc, iloc

In [5]:
tmp = train[
    train['Embarked'].isin(['Q', 'C']) & (train['Age'] > 40)
].head()

In [6]:
tmp

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [7]:
tmp.loc[54:116, 'Pclass':'Parch']

     Pclass                            Name   Sex   Age  SibSp  Parch
54        1  Ostby, Mr. Engelhart Cornelius  male  65.0      0      1
96        1       Goldschmidt, Mr. George B  male  71.0      0      0
116       3            Connors, Mr. Patrick  male  70.5      0      0

In [8]:
tmp.iloc[1:4, 2:8]

     Pclass                            Name   Sex   Age  SibSp  Parch
54        1  Ostby, Mr. Engelhart Cornelius  male  65.0      0      1
96        1       Goldschmidt, Mr. George B  male  71.0      0      0
116       3            Connors, Mr. Patrick  male  70.5      0      0

---

## pandas: sort

In [ ]:
train.sort_values('Name')

In [10]:
train.sort_values('Fare', ascending=False).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S

---

## pandas: create from list

In [12]:
pd.DataFrame(
    [
        [1,3,0],
        [2,4],
        [3,5]
    ]
)

   0  1    2
0  1  3  0.0
1  2  4  NaN
2  3  5  NaN

In [13]:
df_embarked = pd.DataFrame(
    [
        ['C', 'Cherbourg'],
        ['Q', 'Queenstown'],
        ['S', 'Southampton']
    ],
    columns=['id', 'City']
)

In [14]:
df_embarked

  id         City
0  C    Cherbourg
1  Q   Queenstown
2  S  Southampton

---

## pandas: merge

https://pandas.pydata.org/pandas-docs/stable/merging.html

In [17]:
#аналог left join
pd.merge(
    train,
    df_embarked,
    left_on='Embarked',
    right_on='id'
).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,id,City
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,S,Southampton
1,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,S,Southampton
2,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,S,Southampton
3,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,S,Southampton
4,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,S,Southampton

---

## pandas: groupby

In [18]:
train[['Age', 'Sex']].groupby('Sex').median()

         Age
Sex
female  27.0
male    29.0

## pandas: pivot_table

http://pbpython.com/images/pivot-table-datasheet.png

In [19]:
train.pivot_table('PassengerId', 'Pclass', 'Survived', 'count')

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119